In [34]:
import pandas as pd

In [35]:
df = pd.read_csv('data_cleaning_sample.csv')
print(df)

       Name   Age         City Gender              Email   Join Date
0     Alice  25.0     New York      F  alice@example.com  01-05-2021
1   Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2       Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3   Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4     David  22.0       Mumbai      M  david@example.com  12-11-2019
5       NaN  28.0        Delhi      F     eve@domain.com         NaN
6     Alice  25.0     New York      F  alice@example.com  01-05-2021
7     Alice  25.0     New York      F  alice@example.com  01-05-2021
8   Charlie   NaN        Delhi      M    charlie@example  20-07-2021
9     Alice  25.0     New York      F  alice@example.com  01-05-2021
10    Alice  26.0     New York      F  alice@example.com  01-05-2021
11  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

In [36]:
print(df.isnull())
print(df.isnull().sum())

     Name    Age   City  Gender  Email  Join Date
0   False  False  False   False  False      False
1   False   True  False   False  False      False
2   False  False  False   False  False      False
3   False   True  False   False  False      False
4   False  False  False   False  False      False
5    True  False  False   False  False       True
6   False  False  False   False  False      False
7   False  False  False   False  False      False
8   False   True  False   False  False      False
9   False  False  False   False  False      False
10  False  False  False   False  False      False
11  False   True  False   False  False      False
Name         1
Age          4
City         0
Gender       0
Email        0
Join Date    1
dtype: int64

In [37]:
print(df.dropna())
print(df.dropna(axis=1))
# print(df)

     Name   Age         City Gender              Email   Join Date
0   Alice  25.0     New York      F  alice@example.com  01-05-2021
2     Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4   David  22.0       Mumbai      M  david@example.com  12-11-2019
6   Alice  25.0     New York      F  alice@example.com  01-05-2021
7   Alice  25.0     New York      F  alice@example.com  01-05-2021
9   Alice  25.0     New York      F  alice@example.com  01-05-2021
10  Alice  26.0     New York      F  alice@example.com  01-05-2021
           City Gender              Email
0      New York      F  alice@example.com
1         Delhi      M    charlie@example
2   Los Angeles      M    bob@example.com
3         Delhi      M    charlie@example
4        Mumbai      M  david@example.com
5         Delhi      F     eve@domain.com
6      New York      F  alice@example.com
7      New York      F  alice@example.com
8         Delhi      M    charlie@example
9      New York      F  alice@example.com
10     New York      F  alice@example.com
11        Delhi      M    charlie@example

In [38]:
# print(df.fillna(0))
# print(df.fillna({"Age": int(df['Age'].mean()), }))
# print(df.fillna(method='ffill'))
df.ffill()

       Name   Age         City Gender              Email   Join Date
0     Alice  25.0     New York      F  alice@example.com  01-05-2021
1   Charlie  25.0        Delhi      M    charlie@example  20-07-2021
2       Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3   Charlie  30.0        Delhi      M    charlie@example  20-07-2021
4     David  22.0       Mumbai      M  david@example.com  12-11-2019
5     David  28.0        Delhi      F     eve@domain.com  12-11-2019
6     Alice  25.0     New York      F  alice@example.com  01-05-2021
7     Alice  25.0     New York      F  alice@example.com  01-05-2021
8   Charlie  25.0        Delhi      M    charlie@example  20-07-2021
9     Alice  25.0     New York      F  alice@example.com  01-05-2021
10    Alice  26.0     New York      F  alice@example.com  01-05-2021
11  Charlie  26.0        Delhi      M    charlie@example  20-07-2021

In [39]:
# print(df.duplicated())
df.duplicated(subset=['Name', 'Email'])
# print(df.drop_duplicates())
# print(df.drop_duplicates(keep='last'))
# df.drop_duplicates(subset=['Name', 'Email'])

0     False
1     False
2     False
3      True
4     False
5     False
6      True
7      True
8      True
9      True
10     True
11     True
dtype: bool

In [44]:
df["Name"].str.lower()
df["City"].str.contains("Delhi", case = False)
df["Email"].str.replace("example", "sample")
df["Email"].str.split("@")

0     [alice, example.com]
1       [charlie, example]
2       [bob, example.com]
3       [charlie, example]
4     [david, example.com]
5        [eve, domain.com]
6     [alice, example.com]
7     [alice, example.com]
8       [charlie, example]
9     [alice, example.com]
10    [alice, example.com]
11      [charlie, example]
Name: Email, dtype: object

In [47]:
df2 = df.dropna().copy()
df2["Age"] = df2["Age"].astype(int)
df2.info()
df2

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, 0 to 10
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       7 non-null      object
 1   Age        7 non-null      int32
 2   City       7 non-null      object
 3   Gender     7 non-null      object
 4   Email      7 non-null      object
 5   Join Date  7 non-null      object
dtypes: int32(1), object(5)
memory usage: 364.0+ bytes

     Name  Age         City Gender              Email   Join Date
0   Alice   25     New York      F  alice@example.com  01-05-2021
2     Bob   30  Los Angeles      M    bob@example.com  15-06-2020
4   David   22       Mumbai      M  david@example.com  12-11-2019
6   Alice   25     New York      F  alice@example.com  01-05-2021
7   Alice   25     New York      F  alice@example.com  01-05-2021
9   Alice   25     New York      F  alice@example.com  01-05-2021
10  Alice   26     New York      F  alice@example.com  01-05-2021

In [50]:
df2["Age Group"] = df2["Age"].apply(lambda x: "Adult" if x >= 25 else "Minor")
df2

     Name  Age         City Gender              Email   Join Date Age Group
0   Alice   25     New York      F  alice@example.com  01-05-2021     Adult
2     Bob   30  Los Angeles      M    bob@example.com  15-06-2020     Adult
4   David   22       Mumbai      M  david@example.com  12-11-2019     Minor
6   Alice   25     New York      F  alice@example.com  01-05-2021     Adult
7   Alice   25     New York      F  alice@example.com  01-05-2021     Adult
9   Alice   25     New York      F  alice@example.com  01-05-2021     Adult
10  Alice   26     New York      F  alice@example.com  01-05-2021     Adult

In [52]:
gender = {"M": "Male", "F": "Female"}
df2['Gender'] = df2["Gender"].map(gender)
df2

     Name  Age         City  Gender              Email   Join Date Age Group
0   Alice   25     New York  Female  alice@example.com  01-05-2021     Adult
2     Bob   30  Los Angeles    Male    bob@example.com  15-06-2020     Adult
4   David   22       Mumbai    Male  david@example.com  12-11-2019     Minor
6   Alice   25     New York  Female  alice@example.com  01-05-2021     Adult
7   Alice   25     New York  Female  alice@example.com  01-05-2021     Adult
9   Alice   25     New York  Female  alice@example.com  01-05-2021     Adult
10  Alice   26     New York  Female  alice@example.com  01-05-2021     Adult

In [53]:
df2["City"] = df2["City"].replace({"New York": "NYC", "Delhi": "DL"})
df2

     Name  Age         City  Gender              Email   Join Date Age Group
0   Alice   25          NYC  Female  alice@example.com  01-05-2021     Adult
2     Bob   30  Los Angeles    Male    bob@example.com  15-06-2020     Adult
4   David   22       Mumbai    Male  david@example.com  12-11-2019     Minor
6   Alice   25          NYC  Female  alice@example.com  01-05-2021     Adult
7   Alice   25          NYC  Female  alice@example.com  01-05-2021     Adult
9   Alice   25          NYC  Female  alice@example.com  01-05-2021     Adult
10  Alice   26          NYC  Female  alice@example.com  01-05-2021     Adult